StartMilandr/MDR_Pack_v6/PACK_Gen/Files/SPL/Devices/MDR1986VE9x/MDR_RST_VE9x_defs.h
#ifndef _MDR_RST_VE9X_DEFS_H
#define _MDR_RST_VE9X_DEFS_H

#ifdef __cplusplus
extern "C" {
#endif

  
#include <MDR_Types.h>
#include <MDR_TypesVEx.h>
  
  
/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif
/* ========================================  Start of section using anonymous unions  ======================================== */

/* =====================================================  CLOCK_STATUS  ====================================================== */
typedef struct {
      __IM  MDR_OnOff  PLL_USB_RDY : 1;           /*!< [0..0] PLL USP ready                                                    */
      __IM  MDR_OnOff  PLL_CPU_RDY : 1;           /*!< [1..1] PLL CPU ready                                                    */
      __IM  MDR_OnOff  HSE_RDY     : 1;           /*!< [2..2] HSE generator ready                                              */
      __IM  uint32_t               : 29;          /*!< [31..3] UNUSED                                                          */
} MDR_RST_STATUS_Bits;

#define MDR_RST_STATUS__PLL_USB_RDY_Pos (0UL)            /*!< MDR_RST_CLOCK CLOCK_STATUS: PLL_USB_RDY (Bit 0)                  */
#define MDR_RST_STATUS__PLL_USB_RDY_Msk (0x1UL)          /*!< MDR_RST_CLOCK CLOCK_STATUS: PLL_USB_RDY (Bitfield-Mask: 0x01)    */
#define MDR_RST_STATUS__PLL_CPU_RDY_Pos (1UL)            /*!< MDR_RST_CLOCK CLOCK_STATUS: PLL_CPU_RDY (Bit 1)                  */
#define MDR_RST_STATUS__PLL_CPU_RDY_Msk (0x2UL)          /*!< MDR_RST_CLOCK CLOCK_STATUS: PLL_CPU_RDY (Bitfield-Mask: 0x01)    */
#define MDR_RST_STATUS__HSE_RDY_Pos     (2UL)            /*!< MDR_RST_CLOCK CLOCK_STATUS: HSE_RDY (Bit 2)                      */
#define MDR_RST_STATUS__HSE_RDY_Msk     (0x4UL)          /*!< MDR_RST_CLOCK CLOCK_STATUS: HSE_RDY (Bitfield-Mask: 0x01)        */

/* ======================================================  PLL_CONTROL  ====================================================== */
typedef struct {
      __IOM MDR_OnOff   PLL_USB_ON  : 1;           /*!< [0..0] PLL USB Enable                                                  */
      __IOM MDR_OnOff   PLL_USB_RLD : 1;           /*!< [1..1] PLL USB Restart                                                 */  
      __IOM MDR_OnOff   PLL_CPU_ON  : 1;           /*!< [2..2] PLL Enable                                                      */
      __IOM MDR_OnOff   PLL_CPU_RLD : 1;           /*!< [3..3] PLL Restart                                                     */
      __IOM MDR_MUL_x16 PLL_USB_MUL : 4;           /*!< [7..4] PLL USB Mul, [x2 .. x16]                                        */
      __IOM MDR_MUL_x16 PLL_CPU_MUL : 4;           /*!< [11..8] PLL Mul, [x2 .. x16]                                           */
      __IM  uint32_t                : 20;
} MDR_RST_PLL_Bits;

#define MDR_RST_PLL__USB_ON_Pos  (0UL)             /*!< MDR_RST_CLOCK PLL_CONTROL: PLL_USB_ON (Bit 0)                          */
#define MDR_RST_PLL__USB_ON_Msk  (0x1UL)           /*!< MDR_RST_CLOCK PLL_CONTROL: PLL_USB_ON (Bitfield-Mask: 0x01)            */
#define MDR_RST_PLL__USB_RLD_Pos (1UL)             /*!< MDR_RST_CLOCK PLL_CONTROL: PLL_USB_PLD (Bit 1)                         */
#define MDR_RST_PLL__USB_RLD_Msk (0x2UL)           /*!< MDR_RST_CLOCK PLL_CONTROL: PLL_USB_PLD (Bitfield-Mask: 0x01)           */
#define MDR_RST_PLL__CPU_ON_Pos  (2UL)             /*!< MDR_RST_CLOCK PLL_CONTROL: PLL_CPU_ON (Bit 2)                          */
#define MDR_RST_PLL__CPU_ON_Msk  (0x4UL)           /*!< MDR_RST_CLOCK PLL_CONTROL: PLL_CPU_ON (Bitfield-Mask: 0x01)            */
#define MDR_RST_PLL__CPU_RLD_Pos (3UL)             /*!< MDR_RST_CLOCK PLL_CONTROL: PLL_CPU_PLD (Bit 3)                         */
#define MDR_RST_PLL__CPU_RLD_Msk (0x8UL)           /*!< MDR_RST_CLOCK PLL_CONTROL: PLL_CPU_PLD (Bitfield-Mask: 0x01)           */
#define MDR_RST_PLL__USB_MUL_Pos (4UL)             /*!< MDR_RST_CLOCK PLL_CONTROL: PLL_USB_MUL (Bit 4)                         */
#define MDR_RST_PLL__USB_MUL_Msk (0xf0UL)          /*!< MDR_RST_CLOCK PLL_CONTROL: PLL_USB_MUL (Bitfield-Mask: 0x0f)           */
#define MDR_RST_PLL__CPU_MUL_Pos (8UL)             /*!< MDR_RST_CLOCK PLL_CONTROL: PLL_CPU_MUL (Bit 8)                         */
#define MDR_RST_PLL__CPU_MUL_Msk (0xf00UL)         /*!< MDR_RST_CLOCK PLL_CONTROL: PLL_CPU_MUL (Bitfield-Mask: 0x0f)           */


/* ======================================================  HS_CONTROL  ======================================================= */

typedef struct {
      __IOM MDR_OnOff  HSE_ON     : 1;            /*!< [0..0] HSE Enable                                                       */  
      __IOM MDR_OnOff  HSE_BYP    : 1;            /*!< [1..1] HSE Bypass Mode                                                  */
      __IM  uint32_t              : 30;
} MDR_RST_HS_Bits;

#define MDR_RST_HS__HSE_ON_Pos   (0UL)                 /*!< MDR_RST_CLOCK HS_CONTROL: HSE_ON (Bit 0)                           */
#define MDR_RST_HS__HSE_ON_Msk   (0x1UL)               /*!< MDR_RST_CLOCK HS_CONTROL: HSE_ON (Bitfield-Mask: 0x01)             */
#define MDR_RST_HS__HSE_BYP_Pos  (1UL)                 /*!< MDR_RST_CLOCK HS_CONTROL: HSE_BYP (Bit 1)                          */
#define MDR_RST_HS__HSE_BYP_Msk  (0x2UL)               /*!< MDR_RST_CLOCK HS_CONTROL: HSE_BYP (Bitfield-Mask: 0x01)            */

/* =======================================================  CPU_CLOCK  ======================================================= */
typedef struct {
      __IOM MDR_CLK_SEL_HSIE2 CPU_C1_SEL : 2;            /*!< [1..0] CPU_C1 mux freq select                                    */
      __IOM MDR_CLK_SEL_CPU   CPU_C2_SEL : 1;            /*!< [2..2] CPU_C2 mux freq select                                    */
      __IM  uint32_t                     : 1;
      __IOM MDR_Div256P   CPU_C3_SEL : 4;            /*!< [7..4] CPU_C2 mux output freq devider, [/1, /2, /4 .. /256]      */
      __IOM MDR_CLK_SEL_HCLK  HCLK_SEL   : 2;            /*!< [9..8] Select Clock for CPU                                      */
      __IM  uint32_t                     : 22;
} MDR_RST_CPU_Bits;

