StartMilandr/MDR_Pack_v6/PACK_Gen/Files/SPL/Devices/MDR1986VE9x/MDR_RST_VE9x_defs.h
#define MDR_RST_CPU__C1_SEL_Pos     (0UL)                /*!< MDR_RST_CLOCK CPU_CLOCK: CPU_C1_SEL (Bit 0)                      */
#define MDR_RST_CPU__C1_SEL_Msk     (0x3UL)              /*!< MDR_RST_CLOCK CPU_CLOCK: CPU_C1_SEL (Bitfield-Mask: 0x03)        */
#define MDR_RST_CPU__C2_SEL_Pos     (2UL)                /*!< MDR_RST_CLOCK CPU_CLOCK: CPU_C2_SEL (Bit 2)                      */
#define MDR_RST_CPU__C2_SEL_Msk     (0x4UL)              /*!< MDR_RST_CLOCK CPU_CLOCK: CPU_C2_SEL (Bitfield-Mask: 0x01)        */
#define MDR_RST_CPU__C3_SEL_Pos     (4UL)                /*!< MDR_RST_CLOCK CPU_CLOCK: CPU_C3_SEL (Bit 4)                      */
#define MDR_RST_CPU__C3_SEL_Msk     (0xf0UL)             /*!< MDR_RST_CLOCK CPU_CLOCK: CPU_C3_SEL (Bitfield-Mask: 0x0f)        */
#define MDR_RST_CPU__HCLK_SEL_Pos   (8UL)                /*!< MDR_RST_CLOCK CPU_CLOCK: HCLK_SEL (Bit 8)                        */
#define MDR_RST_CPU__HCLK_SEL_Msk   (0x300UL)            /*!< MDR_RST_CLOCK CPU_CLOCK: HCLK_SEL (Bitfield-Mask: 0x03)          */

/* =======================================================  USB_CLOCK  ======================================================= */
typedef struct {
      __IOM MDR_CLK_SEL_HSIE2 USB_C1_SEL : 2;            /*!< [1..0] USB_C1 mux freq select                                    */
      __IOM MDR_CLK_SEL_USB   USB_C2_SEL : 1;            /*!< [2..2] USB_C2 mux freq select                                    */
      __IM  uint32_t                     : 1;
      __IOM MDR_DIV_2         USB_C3_SEL : 1;            /*!< [4..4] USB_C3 Input Select                                       */
      __IM  uint32_t                     : 3;
      __IOM MDR_OnOff         USB_EN     : 1;            /*!< [8..8] USB Clock Enable                                          */
      __IM  uint32_t                     : 23;
} MDR_RST_USB_Bits;

#define MDR_RST_USB__C1_SEL_Pos (0UL)                /*!< MDR_RST_CLOCK USB_CLOCK: USB_C1_SEL (Bit 0)                          */
#define MDR_RST_USB__C1_SEL_Msk (0x3UL)              /*!< MDR_RST_CLOCK USB_CLOCK: USB_C1_SEL (Bitfield-Mask: 0x03)            */
#define MDR_RST_USB__C2_SEL_Pos (2UL)                /*!< MDR_RST_CLOCK USB_CLOCK: USB_C2_SEL (Bit 2)                          */
#define MDR_RST_USB__C2_SEL_Msk (0x4UL)              /*!< MDR_RST_CLOCK USB_CLOCK: USB_C2_SEL (Bitfield-Mask: 0x01)            */
#define MDR_RST_USB__C3_SEL_Pos (4UL)                /*!< MDR_RST_CLOCK USB_CLOCK: USB_C3_SEL (Bit 4)                          */
#define MDR_RST_USB__C3_SEL_Msk (0x10UL)             /*!< MDR_RST_CLOCK USB_CLOCK: USB_C3_SEL (Bitfield-Mask: 0x01)            */
#define MDR_RST_USB__EN_Pos (8UL)                    /*!< MDR_RST_CLOCK USB_CLOCK: USB_EN (Bit 8)                              */
#define MDR_RST_USB__EN_Msk (0x100UL)                /*!< MDR_RST_CLOCK USB_CLOCK: USB_EN (Bitfield-Mask: 0x01)                */

/* =======================================================  ADC_CLOCK  ======================================================= */
typedef struct {
      __IOM MDR_CLK_ADC_C1    ADC_C1_SEL : 2;            /*!< [1..0] ADC_C1 mux freq select                                    */
      __IM  uint32_t                     : 2;
      __IOM MDR_CLK_ADC_C2    ADC_C2_SEL : 2;            /*!< [5..4] ADC_C2 mux freq select                                    */
      __IM  uint32_t                     : 2;
      __IOM MDR_Div256P   ADC_C3_SEL : 4;            /*!< [11..8] ADC_C2 mux output freq devider, [/1, /2, /4 .. /256]     */
      __IM  uint32_t                     : 1;
      __IOM MDR_OnOff         ADC_CLK_EN : 1;            /*!< [13..13] ADC Clock Enable                                        */
      __IM  uint32_t                     : 18;
} MDR_RST_ADC_Bits;

#define MDR_RST_ADC__ADC_C1_SEL_Pos (0UL)                /*!< MDR_RST_CLOCK ADC_CLOCK: ADC_C1_SEL (Bit 0)                      */
#define MDR_RST_ADC__ADC_C1_SEL_Msk (0x3UL)              /*!< MDR_RST_CLOCK ADC_CLOCK: ADC_C1_SEL (Bitfield-Mask: 0x03)        */
#define MDR_RST_ADC__ADC_C2_SEL_Pos (4UL)                /*!< MDR_RST_CLOCK ADC_CLOCK: ADC_C2_SEL (Bit 4)                      */
#define MDR_RST_ADC__ADC_C2_SEL_Msk (0x30UL)             /*!< MDR_RST_CLOCK ADC_CLOCK: ADC_C2_SEL (Bitfield-Mask: 0x03)        */
#define MDR_RST_ADC__ADC_C3_SEL_Pos (8UL)                /*!< MDR_RST_CLOCK ADC_CLOCK: ADC_C3_SEL (Bit 8)                      */
#define MDR_RST_ADC__ADC_C3_SEL_Msk (0xf00UL)            /*!< MDR_RST_CLOCK ADC_CLOCK: ADC_C3_SEL (Bitfield-Mask: 0x0f)        */
#define MDR_RST_ADC__ADC_CLK_EN_Pos (13UL)               /*!< MDR_RST_CLOCK ADC_CLOCK: ADC_CLK_EN (Bit 13)                     */
#define MDR_RST_ADC__ADC_CLK_EN_Msk (0x2000UL)           /*!< MDR_RST_CLOCK ADC_CLOCK: ADC_CLK_EN (Bitfield-Mask: 0x01)        */

/* =======================================================  RTC_CLOCK  ======================================================= */
typedef struct {
      __IOM MDR_Div256P  HSE_SEL    : 4;            /*!< [3..0] RTC HSE freq devider, [/1, /2, /4 .. /256]                 */
      __IOM MDR_Div256P  HSI_SEL    : 4;            /*!< [7..4] RTC HSI freq devider, [/1, /2, /4 .. /256]                 */
      __IOM MDR_OnOff        HSE_RTC_EN : 1;            /*!< [8..8] RTC HSE Clock enable                                       */
      __IOM MDR_OnOff        HSI_RTC_EN : 1;            /*!< [9..9] RTC HSI Clock enable                                       */
      __IM  uint32_t                    : 22;
} MDR_RST_RTC_Bits;

#define MDR_RST_RTC__HSE_SEL_Pos    (0UL)                /*!< MDR_RST_CLOCK RTC_CLOCK: HSE_SEL (Bit 0)                         */
#define MDR_RST_RTC__HSE_SEL_Msk    (0xfUL)              /*!< MDR_RST_CLOCK RTC_CLOCK: HSE_SEL (Bitfield-Mask: 0x0f)           */
#define MDR_RST_RTC__HSI_SEL_Pos    (4UL)                /*!< MDR_RST_CLOCK RTC_CLOCK: HSI_SEL (Bit 4)                         */
#define MDR_RST_RTC__HSI_SEL_Msk    (0xf0UL)             /*!< MDR_RST_CLOCK RTC_CLOCK: HSI_SEL (Bitfield-Mask: 0x0f)           */
#define MDR_RST_RTC__HSE_RTC_EN_Pos (8UL)                /*!< MDR_RST_CLOCK RTC_CLOCK: HSE_RTC_EN (Bit 8)                      */
#define MDR_RST_RTC__HSE_RTC_EN_Msk (0x100UL)            /*!< MDR_RST_CLOCK RTC_CLOCK: HSE_RTC_EN (Bitfield-Mask: 0x01)        */
#define MDR_RST_RTC__HSI_RTC_EN_Pos (9UL)                /*!< MDR_RST_CLOCK RTC_CLOCK: HSI_RTC_EN (Bit 9)                      */
#define MDR_RST_RTC__HSI_RTC_EN_Msk (0x200UL)            /*!< MDR_RST_CLOCK RTC_CLOCK: HSI_RTC_EN (Bitfield-Mask: 0x01)        */

/* =======================================================  PER_CLOCK  ======================================================= */
typedef struct {
      __IOM MDR_OnOff  CAN1_CLK_EN     : 1;         /*!< [0..0] CAN1 Clock Enable                                              */
      __IOM MDR_OnOff  CAN2_CLK_EN     : 1;         /*!< [1..1] CAN2 Clock Enable                                              */
      __IOM MDR_OnOff  USB_CLK_EN      : 1;         /*!< [2..2] USB Clock Enable                                               */
      __IOM MDR_OnOff  EEPROM_CLK_EN   : 1;         /*!< [3..3] EEPROM Controller Clock Enable                                 */
      __IOM MDR_OnOff  RST_CLK_EN      : 1;         /*!< [4..4] RST Clock Enable                                               */
      __IOM MDR_OnOff  DMA_CLK_EN      : 1;         /*!< [5..5] DMA Clock Enable                                               */
      __IOM MDR_OnOff  UART1_CLK_EN    : 1;         /*!< [6..6] UART1 Clock Enable                                             */
      __IOM MDR_OnOff  UART2_CLK_EN    : 1;         /*!< [7..7] UART2 Clock Enable                                             */
      __IOM MDR_OnOff  SPI1_CLK_EN     : 1;         /*!< [8..8] SPI1 Clock Enable                                              */
      __IM  uint32_t                   : 1;         /*!< [9..9] Reserved                                                       */
      __IOM MDR_OnOff  I2C_CLK_EN      : 1;         /*!< [10..10] I2C Clock Enable                                             */
      __IOM MDR_OnOff  PWR_CLK_EN      : 1;         /*!< [11..11] Power Clock Enable                                           */
      __IOM MDR_OnOff  WWDT_CLK_EN     : 1;         /*!< [12..12] WWDT Clock Enable                                            */
      __IOM MDR_OnOff  IWDT_CLK_EN     : 1;         /*!< [13..13] IWDT Clock Enable                                            */
      __IOM MDR_OnOff  TIMER1_CLK_EN   : 1;         /*!< [14..14] TIMER1 Clock Enable                                          */
      __IOM MDR_OnOff  TIMER2_CLK_EN   : 1;         /*!< [15..15] TIMER2 Clock Enable                                          */
      __IOM MDR_OnOff  TIMER3_CLK_EN   : 1;         /*!< [16..16] TIMER3 Clock Enable                                          */
      __IOM MDR_OnOff  ADC_CLK_EN      : 1;         /*!< [17..17] ADC Clock Enable                                             */
      __IOM MDR_OnOff  DAC_CLK_EN      : 1;         /*!< [18..18] DAC Clock Enable                                             */
      __IOM MDR_OnOff  CPM_CLK_EN      : 1;         /*!< [19..19] Comparator Clock Enable                                      */
      __IOM MDR_OnOff  SPI2_CLK_EN     : 1;         /*!< [20..20] SPI2 Clock Enable                                            */
      __IOM MDR_OnOff  PORTA_CLK_EN    : 1;         /*!< [21..21] GPIO PORT_A Clock Enable                                     */
      __IOM MDR_OnOff  PORTB_CLK_EN    : 1;         /*!< [22..22] GPIO PORT_B Clock Enable                                     */
      __IOM MDR_OnOff  PORTC_CLK_EN    : 1;         /*!< [23..23] GPIO PORT_C Clock Enable                                     */
      __IOM MDR_OnOff  PORTD_CLK_EN    : 1;         /*!< [24..24] GPIO PORT_D Clock Enable                                     */
      __IOM MDR_OnOff  PORTE_CLK_EN    : 1;         /*!< [25..25] GPIO PORT_E Clock Enable                                     */
      __IM  uint32_t                   : 1;         /*!< [26..26] Reserved                                                     */
      __IOM MDR_OnOff  BKP_CLK_EN      : 1;         /*!< [27..27] Backup Clock Enable                                          */
      __IM  uint32_t                   : 1;         /*!< [28..28] Reserved                                                     */
      __IOM MDR_OnOff  PORTF_CLK_EN    : 1;         /*!< [29..29] GPIO PORT_F Clock Enable                                     */
      __IOM MDR_OnOff  EBC_CLK_EN      : 1;         /*!< [30..30] External Bus Clock Enable                                    */
      __IM  uint32_t                   : 1;         /*!< [31..31] Reserved                                                     */
} MDR_RST_PER_Bits;

