StartMilandr/MDR_Pack_v6/PACK_Gen/Files/SPL/Devices/MDR1986VE9x/MDR_RST_VE9x_defs.h
#define MDR_RST_PER__CAN1_CLK_EN_Pos    (0UL)             /*!< MDR_RST_CLOCK PER_CLOCK: CAN1_CLK_EN (Bit 0)                   */
#define MDR_RST_PER__CAN1_CLK_EN_Msk    (0x1UL)           /*!< MDR_RST_CLOCK PER_CLOCK: CAN1_CLK_EN (Bitfield-Mask: 0x01)     */
#define MDR_RST_PER__CAN2_CLK_EN_Pos    (1UL)             /*!< MDR_RST_CLOCK PER_CLOCK: CAN2_CLK_EN (Bit 1)                   */
#define MDR_RST_PER__CAN2_CLK_EN_Msk    (0x2UL)           /*!< MDR_RST_CLOCK PER_CLOCK: CAN2_CLK_EN (Bitfield-Mask: 0x01)     */
#define MDR_RST_PER__USB_CLK_EN_Pos     (2UL)             /*!< MDR_RST_CLOCK PER_CLOCK: USB_CLK_EN (Bit 2)                    */
#define MDR_RST_PER__USB_CLK_EN_Msk     (0x4UL)           /*!< MDR_RST_CLOCK PER_CLOCK: USB_CLK_EN (Bitfield-Mask: 0x01)      */
#define MDR_RST_PER__EEPROM_CLK_EN_Pos  (3UL)             /*!< MDR_RST_CLOCK PER_CLOCK: EEPROM_CLK_EN (Bit 3)                 */
#define MDR_RST_PER__EEPROM_CLK_EN_Msk  (0x8UL)           /*!< MDR_RST_CLOCK PER_CLOCK: EEPROM_CLK_EN (Bitfield-Mask: 0x01)   */
#define MDR_RST_PER__RST_CLK_EN_Pos     (4UL)             /*!< MDR_RST_CLOCK PER_CLOCK: RST_CLK_EN (Bit 4)                    */
#define MDR_RST_PER__RST_CLK_EN_Msk     (0x10UL)          /*!< MDR_RST_CLOCK PER_CLOCK: RST_CLK_EN (Bitfield-Mask: 0x01)      */
#define MDR_RST_PER__DMA_CLK_EN_Pos     (5UL)             /*!< MDR_RST_CLOCK PER_CLOCK: DMA_CLK_EN (Bit 5)                    */
#define MDR_RST_PER__DMA_CLK_EN_Msk     (0x20UL)          /*!< MDR_RST_CLOCK PER_CLOCK: DMA_CLK_EN (Bitfield-Mask: 0x01)      */
#define MDR_RST_PER__UART1_CLK_EN_Pos   (6UL)             /*!< MDR_RST_CLOCK PER_CLOCK: UART1_CLK_EN (Bit 6)                  */
#define MDR_RST_PER__UART1_CLK_EN_Msk   (0x40UL)          /*!< MDR_RST_CLOCK PER_CLOCK: UART1_CLK_EN (Bitfield-Mask: 0x01)    */
#define MDR_RST_PER__UART2_CLK_EN_Pos   (7UL)             /*!< MDR_RST_CLOCK PER_CLOCK: UART2_CLK_EN (Bit 7)                  */
#define MDR_RST_PER__UART2_CLK_EN_Msk   (0x80UL)          /*!< MDR_RST_CLOCK PER_CLOCK: UART2_CLK_EN (Bitfield-Mask: 0x01)    */
#define MDR_RST_PER__SSP1_CLK_EN_Pos    (8UL)             /*!< MDR_RST_CLOCK PER_CLOCK: SPI1_CLK_EN (Bit 8)                   */
#define MDR_RST_PER__SSP1_CLK_EN_Msk    (0x100UL)         /*!< MDR_RST_CLOCK PER_CLOCK: SPI1_CLK_EN (Bitfield-Mask: 0x01)     */

#define MDR_RST_PER__I2C_CLK_EN_Pos     (10UL)            /*!< MDR_RST_CLOCK PER_CLOCK: I2C_CLK_EN (Bit 10)                   */
#define MDR_RST_PER__I2C_CLK_EN_Msk     (0x400UL)         /*!< MDR_RST_CLOCK PER_CLOCK: I2C_CLK_EN (Bitfield-Mask: 0x01)      */
#define MDR_RST_PER__PWR_CLK_EN_Pos     (11UL)            /*!< MDR_RST_CLOCK PER_CLOCK: PWR_CLK_EN (Bit 11)                   */
#define MDR_RST_PER__PWR_CLK_EN_Msk     (0x800UL)         /*!< MDR_RST_CLOCK PER_CLOCK: PWR_CLK_EN (Bitfield-Mask: 0x01)      */
#define MDR_RST_PER__WWDT_CLK_EN_Pos    (12UL)            /*!< MDR_RST_CLOCK PER_CLOCK: WWDT_CLK_EN (Bit 12)                  */
#define MDR_RST_PER__WWDT_CLK_EN_Msk    (0x1000UL)        /*!< MDR_RST_CLOCK PER_CLOCK: WWDT_CLK_EN (Bitfield-Mask: 0x01)     */
#define MDR_RST_PER__IWDT_CLK_EN_Pos    (13UL)            /*!< MDR_RST_CLOCK PER_CLOCK: IWDT_CLK_EN (Bit 13)                  */
#define MDR_RST_PER__IWDT_CLK_EN_Msk    (0x2000UL)        /*!< MDR_RST_CLOCK PER_CLOCK: IWDT_CLK_EN (Bitfield-Mask: 0x01)     */
#define MDR_RST_PER__TIMER1_CLK_EN_Pos  (14UL)            /*!< MDR_RST_CLOCK PER_CLOCK: TIMER1_CLK_EN (Bit 14)                */
#define MDR_RST_PER__TIMER1_CLK_EN_Msk  (0x4000UL)        /*!< MDR_RST_CLOCK PER_CLOCK: TIMER1_CLK_EN (Bitfield-Mask: 0x01)   */
#define MDR_RST_PER__TIMER2_CLK_EN_Pos  (15UL)            /*!< MDR_RST_CLOCK PER_CLOCK: TIMER2_CLK_EN (Bit 15)                */
#define MDR_RST_PER__TIMER2_CLK_EN_Msk  (0x8000UL)        /*!< MDR_RST_CLOCK PER_CLOCK: TIMER2_CLK_EN (Bitfield-Mask: 0x01)   */
#define MDR_RST_PER__TIMER3_CLK_EN_Pos  (16UL)            /*!< MDR_RST_CLOCK PER_CLOCK: TIMER3_CLK_EN (Bit 16)                */
#define MDR_RST_PER__TIMER3_CLK_EN_Msk  (0x10000UL)       /*!< MDR_RST_CLOCK PER_CLOCK: TIMER3_CLK_EN (Bitfield-Mask: 0x01)   */
#define MDR_RST_PER__ADC_CLK_EN_Pos     (17UL)            /*!< MDR_RST_CLOCK PER_CLOCK: ADC_CLK_EN (Bit 17)                   */
#define MDR_RST_PER__ADC_CLK_EN_Msk     (0x20000UL)       /*!< MDR_RST_CLOCK PER_CLOCK: ADC_CLK_EN (Bitfield-Mask: 0x01)      */
#define MDR_RST_PER__DAC_CLK_EN_Pos     (18UL)            /*!< MDR_RST_CLOCK PER_CLOCK: DAC_CLK_EN (Bit 18)                   */
#define MDR_RST_PER__DAC_CLK_EN_Msk     (0x40000UL)       /*!< MDR_RST_CLOCK PER_CLOCK: DAC_CLK_EN (Bitfield-Mask: 0x01)      */
#define MDR_RST_PER__CMP_CLK_EN_Pos     (19UL)            /*!< MDR_RST_CLOCK PER_CLOCK: CMP_CLK_EN (Bit 19)                   */
#define MDR_RST_PER__CMP_CLK_EN_Msk     (0x80000UL)       /*!< MDR_RST_CLOCK PER_CLOCK: CMP_CLK_EN (Bitfield-Mask: 0x01)      */
#define MDR_RST_PER__SSP2_CLK_EN_Pos    (20UL)            /*!< MDR_RST_CLOCK PER_CLOCK: SPI2_CLK_EN (Bit 20)                  */
#define MDR_RST_PER__SSP2_CLK_EN_Msk    (0x100000UL)      /*!< MDR_RST_CLOCK PER_CLOCK: SPI2_CLK_EN (Bitfield-Mask: 0x01)     */
#define MDR_RST_PER__PORTA_CLK_EN_Pos   (21UL)            /*!< MDR_RST_CLOCK PER_CLOCK: PORTA_CLK_EN (Bit 21)                 */
#define MDR_RST_PER__PORTA_CLK_EN_Msk   (0x200000UL)      /*!< MDR_RST_CLOCK PER_CLOCK: PORTA_CLK_EN (Bitfield-Mask: 0x01)    */
#define MDR_RST_PER__PORTB_CLK_EN_Pos   (22UL)            /*!< MDR_RST_CLOCK PER_CLOCK: PORTB_CLK_EN (Bit 22)                 */
#define MDR_RST_PER__PORTB_CLK_EN_Msk   (0x400000UL)      /*!< MDR_RST_CLOCK PER_CLOCK: PORTB_CLK_EN (Bitfield-Mask: 0x01)    */
#define MDR_RST_PER__PORTC_CLK_EN_Pos   (23UL)            /*!< MDR_RST_CLOCK PER_CLOCK: PORTC_CLK_EN (Bit 23)                 */
#define MDR_RST_PER__PORTC_CLK_EN_Msk   (0x800000UL)      /*!< MDR_RST_CLOCK PER_CLOCK: PORTC_CLK_EN (Bitfield-Mask: 0x01)    */
#define MDR_RST_PER__PORTD_CLK_EN_Pos   (24UL)            /*!< MDR_RST_CLOCK PER_CLOCK: PORTD_CLK_EN (Bit 24)                 */
#define MDR_RST_PER__PORTD_CLK_EN_Msk   (0x1000000UL)     /*!< MDR_RST_CLOCK PER_CLOCK: PORTD_CLK_EN (Bitfield-Mask: 0x01)    */
#define MDR_RST_PER__PORTE_CLK_EN_Pos   (25UL)            /*!< MDR_RST_CLOCK PER_CLOCK: PORTE_CLK_EN (Bit 25)                 */
#define MDR_RST_PER__PORTE_CLK_EN_Msk   (0x2000000UL)     /*!< MDR_RST_CLOCK PER_CLOCK: PORTE_CLK_EN (Bitfield-Mask: 0x01)    */

#define MDR_RST_PER__BKP_CLK_EN_Pos     (27UL)            /*!< MDR_RST_CLOCK PER_CLOCK: BKP_CLK_EN (Bit 27)                   */
#define MDR_RST_PER__BKP_CLK_EN_Msk     (0x8000000UL)     /*!< MDR_RST_CLOCK PER_CLOCK: BKP_CLK_EN (Bitfield-Mask: 0x01)      */

#define MDR_RST_PER__PORTF_CLK_EN_Pos   (29UL)            /*!< MDR_RST_CLOCK PER_CLOCK: PORTF_CLK_EN (Bit 29)                 */
#define MDR_RST_PER__PORTF_CLK_EN_Msk   (0x20000000UL)    /*!< MDR_RST_CLOCK PER_CLOCK: PORTF_CLK_EN (Bitfield-Mask: 0x01)    */
#define MDR_RST_PER__EBC_CLK_EN_Pos     (30UL)            /*!< MDR_RST_CLOCK PER_CLOCK: EBC_CLK_EN (Bit 30)                   */
#define MDR_RST_PER__EBC_CLK_EN_Msk     (0x40000000UL)    /*!< MDR_RST_CLOCK PER_CLOCK: EBC_CLK_EN (Bitfield-Mask: 0x01)      */



