StartMilandr/MDR_Pack_v6/PACK_Gen/Files/SPL/Devices/MDR1986VE9x/MDR_RST_VE9x_defs.h
/* =======================================================  CAN_CLOCK  ======================================================= */
typedef struct {
      __IOM MDR_Div128P  CAN1_BRG    : 3;     /*!< [2..0] HCLK divider to get CAN1_CLOCK, [/1, /2, /4 .. /128]            */
      __IM  uint32_t                     : 5;
      __IOM MDR_Div128P  CAN2_BRG    : 3;     /*!< [10..8] HCLK freq divider to get CAN2_CLOCK, [/1, /2, /4 ../128]       */
      __IM  uint32_t                     : 13;
      __IOM MDR_OnOff        CAN1_CLK_EN : 1;     /*!< [24..24] CAN1_CLOCK enable                                             */
      __IOM MDR_OnOff        CAN2_CLK_EN : 1;     /*!< [25..25] CAN2_CLOCK enable                                             */
      __IM  uint32_t                     : 6;
} MDR_RST_CAN_Bits;

#define MDR_RST_CAN__CAN1_BRG_Pos    (0UL)               /*!< MDR_RST_CLOCK CAN_CLOCK: CAN1_BRG (Bit 0)                       */
#define MDR_RST_CAN__CAN1_BRG_Msk    (0x7UL)             /*!< MDR_RST_CLOCK CAN_CLOCK: CAN1_BRG (Bitfield-Mask: 0x07)         */
#define MDR_RST_CAN__CAN2_BRG_Pos    (8UL)               /*!< MDR_RST_CLOCK CAN_CLOCK: CAN2_BRG (Bit 8)                       */
#define MDR_RST_CAN__CAN2_BRG_Msk    (0x700UL)           /*!< MDR_RST_CLOCK CAN_CLOCK: CAN2_BRG (Bitfield-Mask: 0x07)         */
#define MDR_RST_CAN__CAN1_CLK_EN_Pos (24UL)              /*!< MDR_RST_CLOCK CAN_CLOCK: CAN1_CLK_EN (Bit 24)                   */
#define MDR_RST_CAN__CAN1_CLK_EN_Msk (0x1000000UL)       /*!< MDR_RST_CLOCK CAN_CLOCK: CAN1_CLK_EN (Bitfield-Mask: 0x01)      */
#define MDR_RST_CAN__CAN2_CLK_EN_Pos (25UL)              /*!< MDR_RST_CLOCK CAN_CLOCK: CAN2_CLK_EN (Bit 25)                   */
#define MDR_RST_CAN__CAN2_CLK_EN_Msk (0x2000000UL)       /*!< MDR_RST_CLOCK CAN_CLOCK: CAN2_CLK_EN (Bitfield-Mask: 0x01)      */


/* =======================================================  TIM_CLOCK  ======================================================= */
typedef struct {
      __IOM MDR_Div128P  TIM1_BRG   : 3;            /*!< [2..0] freq divider to get TIM1_CLOCK, [/1, /2, /4 .. /128]      */
      __IM  uint32_t                    : 5;
      __IOM MDR_Div128P  TIM2_BRG   : 3;            /*!< [10..8] freq divider to get TIM2_CLOCK, [/1, /2, /4 ../128]      */
      __IM  uint32_t                    : 5;
      __IOM MDR_Div128P  TIM3_BRG   : 3;            /*!< [18..16] freq divider to get TIM3_CLOCK, [/1, /2, /4 ../128]     */
      __IM  uint32_t                    : 5;
      __IOM MDR_OnOff       TIM1_CLK_EN : 1;            /*!< [24..24] TIM1_CLOCK enable                                       */
      __IOM MDR_OnOff       TIM2_CLK_EN : 1;            /*!< [25..25] TIM2_CLOCK enable                                       */
      __IOM MDR_OnOff       TIM3_CLK_EN : 1;            /*!< [26..26] TIM3_CLOCK enable                                       */
      __IM  uint32_t                    : 5;
} MDR_RST_TIM_Bits;

#define MDR_RST_TIM__TIM1_BRG_Pos    (0UL)               /*!< MDR_RST_CLOCK TIM_CLOCK: TIM1_BRG (Bit 0)                       */
#define MDR_RST_TIM__TIM1_BRG_Msk    (0x7UL)             /*!< MDR_RST_CLOCK TIM_CLOCK: TIM1_BRG (Bitfield-Mask: 0x07)         */
#define MDR_RST_TIM__TIM2_BRG_Pos    (8UL)               /*!< MDR_RST_CLOCK TIM_CLOCK: TIM2_BRG (Bit 8)                       */
#define MDR_RST_TIM__TIM2_BRG_Msk    (0x700UL)           /*!< MDR_RST_CLOCK TIM_CLOCK: TIM2_BRG (Bitfield-Mask: 0x07)         */
#define MDR_RST_TIM__TIM3_BRG_Pos    (16UL)              /*!< MDR_RST_CLOCK TIM_CLOCK: TIM3_BRG (Bit 16)                      */
#define MDR_RST_TIM__TIM3_BRG_Msk    (0x70000UL)         /*!< MDR_RST_CLOCK TIM_CLOCK: TIM3_BRG (Bitfield-Mask: 0x07)         */
#define MDR_RST_TIM__TIM1_CLK_EN_Pos (24UL)              /*!< MDR_RST_CLOCK TIM_CLOCK: TIM1_CLK_EN (Bit 24)                   */
#define MDR_RST_TIM__TIM1_CLK_EN_Msk (0x1000000UL)       /*!< MDR_RST_CLOCK TIM_CLOCK: TIM1_CLK_EN (Bitfield-Mask: 0x01)      */
#define MDR_RST_TIM__TIM2_CLK_EN_Pos (25UL)              /*!< MDR_RST_CLOCK TIM_CLOCK: TIM2_CLK_EN (Bit 25)                   */
#define MDR_RST_TIM__TIM2_CLK_EN_Msk (0x2000000UL)       /*!< MDR_RST_CLOCK TIM_CLOCK: TIM2_CLK_EN (Bitfield-Mask: 0x01)      */
#define MDR_RST_TIM__TIM3_CLK_EN_Pos (26UL)              /*!< MDR_RST_CLOCK TIM_CLOCK: TIM3_CLK_EN (Bit 26)                   */
#define MDR_RST_TIM__TIM3_CLK_EN_Msk (0x4000000UL)       /*!< MDR_RST_CLOCK TIM_CLOCK: TIM3_CLK_EN (Bitfield-Mask: 0x01)      */


/* ======================================================  UART_CLOCK  ======================================================= */
typedef struct {
      __IOM MDR_Div128P  UART1_BRG    : 3;          /*!< [2..0] PER1_C2 freq divider to get UART1_CLOCK, [/1, /2, /4 .. /128]   */
      __IM  uint32_t                      : 5;
      __IOM MDR_Div128P  UART2_BRG    : 3;          /*!< [10..8] PER1_C2 freq divider to get UART2_CLOCK, [/1, /2, /4 .. /128]  */
      __IM  uint32_t                      : 13;
      __IOM MDR_OnOff        UART1_CLK_EN : 1;          /*!< [24..24] UART1_CLOCK enable                                            */
      __IOM MDR_OnOff        UART2_CLK_EN : 1;          /*!< [25..25] UART2_CLOCK enable                                            */
      __IOM uint32_t                      : 6;
} MDR_RST_UART_Bits;

#define MDR_RST_UART__UART1_BRG_Pos    (0UL)             /*!< MDR_RST_CLOCK UART_CLOCK: UART1_BRG (Bit 0)                       */
#define MDR_RST_UART__UART1_BRG_Msk    (0x7UL)           /*!< MDR_RST_CLOCK UART_CLOCK: UART1_BRG (Bitfield-Mask: 0x07)         */
#define MDR_RST_UART__UART2_BRG_Pos    (8UL)             /*!< MDR_RST_CLOCK UART_CLOCK: UART2_BRG (Bit 8)                       */
#define MDR_RST_UART__UART2_BRG_Msk    (0x700UL)         /*!< MDR_RST_CLOCK UART_CLOCK: UART2_BRG (Bitfield-Mask: 0x07)         */
#define MDR_RST_UART__UART1_CLK_EN_Pos (24UL)            /*!< MDR_RST_CLOCK UART_CLOCK: UART1_CLK_EN (Bit 24)                   */
#define MDR_RST_UART__UART1_CLK_EN_Msk (0x1000000UL)     /*!< MDR_RST_CLOCK UART_CLOCK: UART1_CLK_EN (Bitfield-Mask: 0x01)      */
#define MDR_RST_UART__UART2_CLK_EN_Pos (25UL)            /*!< MDR_RST_CLOCK UART_CLOCK: UART2_CLK_EN (Bit 25)                   */
#define MDR_RST_UART__UART2_CLK_EN_Msk (0x2000000UL)     /*!< MDR_RST_CLOCK UART_CLOCK: UART2_CLK_EN (Bitfield-Mask: 0x01)      */


/* =======================================================  SSP_CLOCK  ======================================================= */
typedef struct {
      __IOM MDR_Div128P  SSP1_BRG     : 3;          /*!< [2..0] HCLK freq divider to get SSP1_CLOCK, [/1, /2, /4 .. /128]   */
      __IM  uint32_t                      : 5;
      __IOM MDR_Div128P  SSP2_BRG     : 3;          /*!< [10..8] HCLK freq divider to get SSP2_CLOCK, [/1, /2, /4 .. /128]  */
      __IM  uint32_t                      : 5;
      __IOM MDR_Div128P  SSP3_BRG     : 3;          /*!< [18..16] HCLK freq divider to get SSP3_CLOCK, [/1, /2, /4 .. /128] */
      __IM  uint32_t                      : 5;
      __IOM MDR_OnOff     SSP1_CLK_EN     : 1;         /*!< [24..24] SSP1_CLOCK Enable                                          */
      __IOM MDR_OnOff     SSP2_CLK_EN     : 1;         /*!< [25..25] SSP2_CLOCK Enable                                          */
      __IOM MDR_OnOff     SSP3_CLK_EN     : 1;         /*!< [26..26] SSP3_CLOCK Enable                                          */
      __IM  uint32_t                      : 5;
} MDR_RST_SSP_Bits;

#define MDR_RST_SSP__SSP1_BRG_Pos    (0UL)               /*!< MDR_RST_CLOCK SSP_CLOCK: SSP1_BRG (Bit 0)                         */
#define MDR_RST_SSP__SSP1_BRG_Msk    (0x7UL)             /*!< MDR_RST_CLOCK SSP_CLOCK: SSP1_BRG (Bitfield-Mask: 0x07)           */
#define MDR_RST_SSP__SSP2_BRG_Pos    (8UL)               /*!< MDR_RST_CLOCK SSP_CLOCK: SSP2_BRG (Bit 8)                         */
#define MDR_RST_SSP__SSP2_BRG_Msk    (0x700UL)           /*!< MDR_RST_CLOCK SSP_CLOCK: SSP2_BRG (Bitfield-Mask: 0x07)           */
#define MDR_RST_SSP__SSP3_BRG_Pos    (16UL)              /*!< MDR_RST_CLOCK SSP_CLOCK: SSP3_BRG (Bit 16)                        */
#define MDR_RST_SSP__SSP3_BRG_Msk    (0x70000UL)         /*!< MDR_RST_CLOCK SSP_CLOCK: SSP3_BRG (Bitfield-Mask: 0x07)           */
#define MDR_RST_SSP__SSP1_CLK_EN_Pos (24UL)              /*!< MDR_RST_CLOCK SSP_CLOCK: SSP1_CLK_EN (Bit 24)                     */
#define MDR_RST_SSP__SSP1_CLK_EN_Msk (0x1000000UL)       /*!< MDR_RST_CLOCK SSP_CLOCK: SSP1_CLK_EN (Bitfield-Mask: 0x01)        */
#define MDR_RST_SSP__SSP2_CLK_EN_Pos (25UL)              /*!< MDR_RST_CLOCK SSP_CLOCK: SSP2_CLK_EN (Bit 25)                     */
#define MDR_RST_SSP__SSP2_CLK_EN_Msk (0x2000000UL)       /*!< MDR_RST_CLOCK SSP_CLOCK: SSP2_CLK_EN (Bitfield-Mask: 0x01)        */
#define MDR_RST_SSP__SSP3_CLK_EN_Pos (26UL)              /*!< MDR_RST_CLOCK SSP_CLOCK: SSP3_CLK_EN (Bit 26)                     */
#define MDR_RST_SSP__SSP3_CLK_EN_Msk (0x4000000UL)       /*!< MDR_RST_CLOCK SSP_CLOCK: SSP3_CLK_EN (Bitfield-Mask: 0x01)        */


